antwal/antwal-svnconv/CooCox/STM32GatwayRev0.1/Modem/ModemInterface.c
#include <stdio.h>
#include "string.h"
#include <CoOS.h>     /*!< CoOS header file	         */
#include "cox_serial.h"
#include "STM32_USART.h"
#include <stm32_pio.h>
#include "stm32f10x.h"
#include "buffer.h"
#include "main.h"
#include "modem.h"
#include "ntp.h"
#include "debug.h"

	COX_SERIAL_PI *myUSART1 = &pi_serial1;



	unsigned char signal[2];							// Stores signal strength
	char ipAddr[20] = {'\0'};							// used to store ip address

	enum {
	SHUT = 0,
	PDPDEACT,
	INIT,
	NWATT,
	APN,
	NWUP,
	IPCONFIG,
	IPGPRSACT,
	IP,
	CONNECTING,
	CONNECT,
	CLOSE,
	FORCED,
	SIGLVL,
	CLOSING
	};

	unsigned char state = SHUT;
	unsigned char addr1, addr2, addr3, addr4;      				// Assigned IP address
	extern	cBuffer modem_buffer;								// Receive Buffer for modem
	extern 	unsigned char *mBuffer;


	// Takes the return values
	mdmStatus res;

	mdmStatus sendwait(mdmIface *mdm,const char *send, const char * resp, unsigned int timeout);
	/*
	 *  This function creates mutes which will be used to
	 *  get mutually exclusive access of modem
	 */
	mdmStatus mdmCreateLock(mdmIface * mdm)
	{
		modem_mutex = CoCreateMutex();
		return modem_mutex;
	}

	/*
	 *  This function gets the lock for modem before using it
	 *  If lock is assigned it changes lock var in mdmiface to 1
	 *  which indicates modem in use
	 */
	mdmStatus mdmLock(mdmIface *mdm)
	{
		uint8_t res;
		/* Lock the Mutex*/
		res = CoEnterMutexSection(modem_mutex);
		// If lock is assigned indicate it by lock var in mdmiface
		if(res == E_OK)
		{
			mdm->lock = 1;
			// If modem is locked it's time to wake it up
			mdmWakeUp(mdm);
			sendwait(mdm, "AT+CFUN=1\r", "OK", 200);
		}
		return res;
	}

	/*
	 *  This function releases the lock for modem after using it
	 *  If lock is released it changes lock var in mdmiface to 0
	 *  which indicates modem is free
	 */
	mdmStatus mdmUnLock(mdmIface *mdm)
	{
		uint8_t res;
		/* Unlock the Mutex*/
		res = CoLeaveMutexSection(modem_mutex);
		// If lock is unassigned indicate it by lock var in mdmiface
		if(res == E_OK)
			mdm->lock = 0;

		sendwait(mdm, "AT+CFUN=0\r", "OK", 500);
		return res;
	}

	/*
	 * putting modem in sleep by pulling DTR pin low
	 */
	void mdmSleep(mdmIface *mdm)
	{
		mdm->pio->Out(mdm->dtr_pin, 0);			// Setting low on dtr pin
	}

	/*
	 * Waking up modem by pulling DTR pin high
	 */
	void mdmWakeUp(mdmIface *mdm)
	{
		mdm->pio->Out(mdm->dtr_pin, 1);			// Setting high on dtr pin

	}

	/* used to indicate if any write operation is done or not
		toggle = 0; // write not done or same payload is requested to be read in small chunk
		toggle = 1; // write done so new packet is available to be read
	*/
	uint8_t toggle = 0;
	char  count;

	void USART1_IRQHandler(void)
	{
		char ch;
		CoEnterISR ();

		//RXNE interrupt occured
		//printf("uart%x\n\r",USART1->SR);

		if((USART1->SR & 0x20) != (u16)RESET )
		{
			//count ++;
			ch = (USART1->DR & (us16)0x01FF);
			if(bufferIsNotFull(&modem_buffer)){
				bufferAddToEnd(&modem_buffer, ch);					// Keeping data into the buffer

			}
			else{
				debug(LOG,"Buffer Full %c\n\r",ch);
			}
		}
		else if((USART1->SR & 0x08) != (u16)RESET)			// Handling overrun error
		{
			debug(LOG,"%s\n\r","Overrun");
			ch = (USART1->DR & (us16)0x01FF);
			if(bufferIsNotFull(&modem_buffer)){
				bufferAddToEnd(&modem_buffer, ch);					// Keeping data into the buffer
				//printf("-%c",ch);
			}
			else{
				debug(LOG,"Buffer Full %c\n\r",ch);
			}
		}
		CoExitISR ( );
	}
	/*
		*	This function copies the string from start to one before the end character
		*	@lBuff Buffer with copied string
		*	@start starting character
		*	@end end character
		*	@return success or failure
		*/
		mdmStatus serialCopy(char* lbuff, char start, char end)
		{
			char i=0;
			TIME_SET(0);
			do{
				if(serial_rx_ready())
				{
					serial_get(addr4);                  					// get character
					if(addr4 == start)
					{
						addr4 = 0;
				// Copy till it matches the end character or timeout occurs
						TIME_SET(0);
						do{
							if(serial_rx_ready()){
								TIME_SET(0);
								serial_get(addr4);
								lbuff[i++] = addr4;
						}

					}
					while(addr4 != end && TIME_TICK < 500);
					lbuff[i-1] = '\0';									// Overwriting the end character with the null character

					return mdmOK;
					}
				}

			}
			while(TIME_TICK < 1000);
			return mdmFail;
		}

		/*
		* This function matches the data received with the res buffer
		* @res buffer with which rcvd data to be matched
		* @timeout Time to wait for response
		* @return If matched SUCCESS else FAIL
		*/
		mdmStatus serialMatch(mdmIface *mdm, const char *resp, unsigned int timeout)
		{
			addr2 = addr4 = 0;
			char err[10]="ERROR\r\n";
			char errVar = 0;
			debug(CONSOLE,"%s","<<== ");
            for (TIME_SET(0); TIME_TICK<timeout; )           						// loop until time runs out
			{
					if (serial_rx_ready())
					{
						serial_get(addr4);                  					// get character

						if(addr4 != '\r' && addr4 != '\n')
						dbg_printf("%c ",addr4);
						if (resp[addr2] == addr4)
						{
							addr2++;  											// does char match response string
							if (!resp[addr2]){										// All char are matched
							dbg_printf("%s","\n\r");
							return mdmOK;  }    									// finished if string matches
						}
						else addr2 = 0;

						// To match error Condition
						if(err[errVar] == addr4)
						{
							errVar++;  											// does char match response string
							if (!err[errVar]){										// All char are matched
								dbg_printf("%s","\n\r");
								return mdmErr;
							}
						}
						else errVar = 0;													// otherwise reset match pointer
						TIME_SET(0);

						if (!resp[addr2]){										// All char are matched
							return mdmOK;            							// finished if string matches
						}
					}
			}
			if(TIME_TICK >= timeout)
			{
				dbg_printf("%s","\n\r");
				return mdmTimeOut;
			}

			return mdmFail;
		}


		mdmStatus sendwait(mdmIface *mdm,const char *send, const char * resp, unsigned int timeout) {
			addr2=addr3=0;
			// Sending commands to the modem
			debug(CONSOLE,"%s","==>> ");
			do{
				if (serial_tx_ready() ) {  													// if char to send and Tx ready
					if(send[addr3] != '\r')
						dbg_printf("%c ", send[addr3]);
					else
						dbg_printf("%s","\n\r");
					if (send[addr3]=='|') { 												// if pause character
						TIME_SET(0);
						while (TIME_TICK < 100);     									// Polling; has 1 second expired yet?
						TIME_SET(0);													// if yes clear timer
						addr3++;              				       							// and point to next character
					}
					else {
						TIME_SET(0);
						serial_send(send[addr3]);							   				// send the character
						addr3++;                    									// point to next char in tx string
					}
				}
			   }
			   // While there is something to send
			   while(send[addr3]);

				switch (state)
				{

					case SIGLVL:
							res = serialMatch(mdm, "+CSQ: ",timeout);
							serial_get(signal[0]);
							serial_get(signal[1]);
							res = serialMatch(mdm, "OK",10);
							debug(CONSOLE,"SIGNAL:%s\n\r",signal);
							break;

					case IP:

