antwal/antwal-svnconv/CooCox/STM32GatwayRev0.1/Modem/ModemInterface.c
							TIME_SET(0);
							do{
								if(serial_rx_ready())
								{
									serial_get(res);
									//printf("0x%x\n",res);
								}
							}
							while(TIME_TICK < 100 && (res == '\r' || res == '\n' ));

							TIME_SET(0);
							do{
								if(serial_rx_ready())
								{
									if( (res >= 0x30 && res <= 0x39) || res == '.')
									mdm->ip_addr[addr2++]= res;
									serial_get(res);
								}
							}
							while(TIME_TICK < 1000 && res != '\r');
							mdm->ip_addr[addr2]= '\0';
							debug(CONSOLE,"IPlen=%d\n\r",addr2);
							debug(LOG,"IP=%s\n\r",mdm->ip_addr);
							if(addr2 < 6)
								state = IPGPRSACT;						// IPaddress cannot be retrieved
							res = mdmOK;

							break;

					default:
							if(resp != NULL)
							res = serialMatch(mdm, resp,timeout);
							else
							dbg_printf("%s","\n\r");
							res = mdmOK;
							break;
				}

			return res;
		}

		mdmStatus mdmState(mdmIface *mdm)
		{
			char lBuff[20];
			uint8_t try;
			static unsigned char var = 0;
			count = 0;
			do{
				try = 2;
				do{
					if(state == CONNECT || state == CLOSE)
						sendwait(mdm, "|+++\r","OK",100);

					res = sendwait(mdm, "AT+CIPSTATUS\r", "STATE:",100);
					try-- ;
				}
				while(res != mdmOK && try > 0);

				try = 0;

				/* CIPSTATUS output is like- STATE: IP INITIAL*/
				res = serialCopy(lBuff, ' ', '\r');
				debug(CONSOLE,"Status is %s\n\r",lBuff);

				if(!strcmp(lBuff, "IP INITIAL"))
					state = INIT;
				else
				if(!strcmp(lBuff,"PDP DEACT"))
					state = PDPDEACT;
				else
				if(!strcmp(lBuff,"TCP CLOSED"))
				{
					state = CLOSE;
				}
				else
				if(!strcmp(lBuff,"UDP CLOSED"))
				{
					state = CLOSE;
				}
				else
				if(!strcmp(lBuff,"CLOSED"))
				{
					state = CLOSE;
				}
				else
				if(!strcmp(lBuff, "IP START"))
					state = NWATT;
				else
				if(!strcmp(lBuff, "IP STATUS"))
				{
					state = IP;
				}
				else
				if(!strcmp(lBuff, "IP CONFIG"))
					state = IPCONFIG;
				else
				if(!strcmp(lBuff, "IP GPRSACT"))
					state = IPGPRSACT;
				else
				if(!strcmp(lBuff, "CONNECT OK"))
					state = CONNECT;
				else
				if(!strcmp(lBuff, "TCP CONNECTING")){
					var++;
					count += 1;
					if(var > 2){
						state = CLOSING;
						var = 0;
						try = 0;
					}
				}
				else
				{
					count += 1;
					try = 1;
				}
			}
			while((count > 0 && count < 3) && (try == 1) );

			// This means Modem is not responding; some problem with modem; reset the modem
			if(count >=3)
			{
				// Reset the modem
				debug(LOG,"%s\n\r","Modem Not responding");
			}

			return res;
		}



	mdmStatus mdmFSM(mdmIface *mdm)
	{
		uint8_t var;
		res = mdmInit(mdm);
		state = CLOSE;

		res = mdmState(mdm);
		var = 20;
		if(res == mdmOK){
		do{
			switch(state)
			{
				case SHUT:
				case FORCED:
					res = mdmInit(mdm);
					break;

				case INIT:
					res = mdmNWControl(mdm, 1);
					break;

				case NWATT:
					res = mdmIPup(mdm);
					break;

				case PDPDEACT:
					res = mdmShut(mdm);
					break;

				case IPGPRSACT:
				case IPCONFIG:
					state = IP;
					//res = sendwait(mdm, "AT+CIPHEAD=1\r", "OK", 200);
					res = sendwait(mdm, "|AT+CIFSR\r", "", 500);
					break;

				case IP:
					//res = sendwait(mdm, "AT+CIPHEAD=1\r", "OK", 200);
					res = sendwait(mdm, "|AT+CIFSR\r", "", 500);

					break;

				case CONNECT:
					res = mdmClose(mdm);
					break;
				case CLOSE:
					state = IPGPRSACT;
					break;

				default:
					break;

			}
		}
		while(state != IP && var-- > 0);
		if(var > 0){
			debug(LOG,"%s\n\r","Modem intialised successfully");
			return mdmOK;
		}
		else
			return res;
		}
		return res;
	}


	/*
	*	This function initialises the modem to its default state
	*/
	mdmStatus mdmInit(mdmIface *mdm)
	{
		uint8_t count = 0;
		res = mdmOK;

		if(state == SHUT || state == CLOSE || state == FORCED)
		{
			do{
				count ++;
				res = sendwait(mdm,"\r|+++|\r", "OK", 200);
				res = sendwait(mdm, "AT\r", "OK", 300);
			}
			while(res != mdmOK && count < 3);

			res	= sendwait(mdm,"ATZ\r", "OK",200);
			res = sendwait(mdm,"|AT S7=45 S0=0 L1 V1 X4 &c1 E0 Q0\r", "OK", 1000);

			if(res != mdmOK)
			{
				// reset the modem; It's not responding
			}
			//res = sendwait(mdm,"AT&FS11=55\r", "OK", 300);
			res = sendwait(mdm,"|AT+IFC=2,2\r","OK",300); //for configuring h/w flow control
			res = sendwait(mdm, "|ATE0\r", "OK",500);
			res = sendwait(mdm, "AT+CMEE=0\r", "OK", 100);
			res = sendwait(mdm, "|AT+CIPMODE=1\r","OK",300);

		}
		state = INIT;
		if(res != mdmOK)
			return mdmInitFail;

		return res;

	}

	/*
	*	This function controls the network related jobs like:
	*	- Attaching/dettaching to/from the network
	*	- Setting apn address
	*/
	mdmStatus mdmNWControl(mdmIface *mdm,uint8_t attach)
	{
		res = mdmOK;

		if(attach == 1)
		res = sendwait(mdm, "|AT+CGATT=1\r", "OK", 500);
		else{
		res = sendwait(mdm, "|AT+CGATT=0\r", "OK", 300);
		state = CLOSE;
		return res;
		}

		if(res != mdmOK)
		return mdmAttFail;
		mdmState(mdm);
		if (state == INIT || state == FORCED)
		{
			//Setting APN adddress for GSM
			sendwait(mdm,"AT+CSTT=",NULL,0);			// Sending the command
			sendwait(mdm, APaddr, NULL, 0);				// Send AP addr
			res = sendwait(mdm,"\r","OK", 200);

			if(res != mdmOK)
				return mdmApnFail;
		}
		state = NWATT;

		return res;


	}


	/*
	*	This function ups the Interface and get a new IP
	*/
	mdmStatus mdmIPup(mdmIface *mdm)
	{
		uint8_t var;
		res = mdmOK;
		if(state == NWATT)
		{
			res = sendwait(mdm, "|AT+CIICR\r","OK", 1000);
			var = 3;
			do
			{
				mdmState(mdm);
				var --;

			}
			while(state != IPGPRSACT && var > 0);

			if(!(var > 0))
				return mdmIPFail;


		/* Display IP head in RECV data(e.g. +IPD,5:test1)
		*  It let us to distinguish between data and AT response
		*  number after IPD is length of the payload
		*  Payload follows after colon.
		*/
			res = sendwait(mdm, "AT+CIPHEAD=1\r", "OK", 200);
			if(res != mdmOK)
				return mdmFail;

		// If till this point things are successful that means we reach IP state
			state = IP;
			res = sendwait(mdm, "|AT+CIFSR\r", "", 500);

			if(res != mdmOK)
				return mdmIPFail;

