antwal/antwal-svnconv/CooCox/STM32GatwayRev0.1/Modem/ModemInterface.c
		}

		return res;
	}

	/*
	*	This function connects to the TCP server
	*	It takes server object which keeps ipaddr and port
	*/
	mdmStatus mdmTCPConnect(mdmIface *mdm, server *obj)
	{

		char count = 3;
		do{
		debug(CONSOLE,"%s\n\r","In TCPconnect");
			mdmState(mdm);
			count --;
			// If state is one among the these start connecting
			if(state == IP || state == IPGPRSACT || state == CLOSE)
			{
				state = CONNECTING;

				sendwait(mdm, "AT+CIPSTART=\"TCP\",\"",NULL,0);
				sendwait(mdm, obj->addr,NULL,0);
				sendwait(mdm,"\",",NULL, 0);
				sendwait(mdm, obj->port, NULL, 0);
				res = sendwait(mdm, "\r","CONNECT\r\n",3000);


				// If timeout occured and connection does not succeded
				if(res == mdmTimeOut){
					debug(LOG,"%s\n\r","TCPConnectionFailed");
					mdmSwitch(mdm,COMMAND);
					mdmClose(mdm);
					mdmShut(mdm);
					mdmFSM(mdm);
					res = mdmTimeOut;
				}

			}
			else if(state == CLOSING)
			{
				res = mdmClose(mdm);
				count ++;
				res = mdmFail;
			}
			// If state is not among the above considered start from begining and get IP
			else{
				mdmFSM(mdm);
				res = mdmFail;
			}
		}
		while(res != mdmOK && count > 0);

		if(count > 0)
			state = CONNECT;
		else
			state = CONNECTING;
		return res;
	}

	/*
	*	This function connects to the UDP server
	*`	It takes server object which keeps ipadddr and port
	*/
	mdmStatus mdmUDPConnect(mdmIface *mdm, server *obj)
	{

		char var;
		res = mdmFail;
		var =3;
		do
		{
			debug(CONSOLE,"%s\n\r","In UDPconnect");
			mdmState(mdm);
			var --;
			if(state == IP|| state == CLOSE || state == IPGPRSACT )
			{
				state = CONNECTING;

				sendwait(mdm, "AT+CIPSTART=\"UDP\",\"",NULL,0);
				sendwait(mdm, obj->addr,NULL,0);
				sendwait(mdm,"\",",NULL, 0);
				sendwait(mdm, obj->port, NULL, 0);
				res = sendwait(mdm, "\r","CONNECT\r\n",2000);

				if(res == mdmTimeOut){
					debug(LOG,"%s\n\r","UDPConnectionFailed");
					mdmSwitch(mdm,COMMAND);
					mdmClose(mdm);
					mdmShut(mdm);
					mdmFSM(mdm);
					res = mdmTimeOut;
				}
			}
			else if(state == CLOSING)
			{
				res = mdmClose(mdm);
				count ++;
				res = mdmFail;
			}
			else{
				res = mdmFail;
			}
		}
		while(res != mdmOK && var > 0);

		if(var > 0)
		state = CONNECT;
		else
		state = CONNECTING;

		return res;
	}

	/*
	 *  W
	 */
	mdmStatus mdmSend(mdmIface *mdm)
	{

		res = mdmState(mdm);
		count = 3;
		if(state == CONNECT){
		do
		{
			count --;
			res = sendwait(mdm, "AT+CIPSEND\r", ">", 1000);
		}
		while(res != mdmOK && count > 0);
		}
		else
		{
			return mdmConnectFail;
		}

		if(!(count > 0))
		{
			state = SHUT;
			res = mdmTimeOut;
		}

		return res;
	}

	/*
	*	This function should be used after connect
	*	It writes the data to the open socket whether it is UDP or TCP
	*	@buffer - this is the buffer which will be sent
	*	@len	- length of the buffer
	*	@send   - this tells if the buffer should be sent or just kept in the modem buffer
	*/
	mdmStatus mdmWrite(mdmIface *mdm, char *buffer, uint32_t len, uint8_t send)
	{
		uint16_t i;									// Number of retries to send the PAcket
		char var =0;

		debug(CONSOLE,"%s\n\r","IN write");
	  if(state == CONNECT){
		count = 3;
		do{
			for(i = 0; i< len; i++)
			{
				serial_send(buffer[i]);
				dbg_printf(" %c",buffer[i]);
			}

			count--;
			if(send == 1)
			{
				var = 3;
				do{
					var --;
					i = 0x1a;
					serial_send(i);									// Sending Ctrl+Z
					res = serialMatch(mdm, "SEND OK", 2000);
				}
				while(res!= mdmOK && var > 0);

			}
			else
			res = mdmOK;
			//printf("res=%d,count=%d\n",res,count);
		}
		while(res != mdmOK && count > 0);

		if(count > 0){
			toggle = 1;
			debug(CONSOLE,"%s\n\r","write success");
			return mdmOK;
		}
		else{
			debug(CONSOLE,"%s\n\r","write failed");
			i = 0x1a;
			serial_send(i);									// Sending Ctrl+Z
			serial_send(i);									// Sending Ctrl+Z
			serial_send(i);									// Sending Ctrl+Z
			return mdmSendFail;
		}
	 }
	 return mdmSendFail;

	}

	/*
	 * This function is used to write data to the
	 * open TCP or UDP socket.
	 * This should be used with transparent mode.
	 * parameters:
	 * @mdm: MOdem Interface
	 * @buffer: Data to be sent
	 * @len: length of bytes to be written
	 * @returns success or fail
	 */
	mdmStatus mdmTransSend(mdmIface *mdm, char *buffer, uint32_t len)
	{
		uint32_t i;
		debug(CONSOLE,"%s\n\r","In Transwrite");
		  if(state == CONNECT){

				for(i = 0; i< len; i++)
				{
					serial_send(buffer[i]);
					dbg_printf("%c ",buffer[i]);
					// If while sending modem returns error transsend should exit
					if(serial_rx_ready())
					{
						res = serialMatch(mdm, "CLOSED", 100);
						if(res == mdmOK || res == mdmErr)
						{
							debug(LOG,"%s\n\r","Connection Closed or Error Returned");
							mdmSwitch(mdm,COMMAND);
							return mdmSendFail;
						}
					}
				}
				toggle = 1;

			return mdmOK;
		}
		  else if( state == CONNECTING)
		  {
			  mdmSwitch(mdm,COMMAND);
			  return mdmSendFail;
		  }
	}

	/*
	*	This function is used to read data from the open socket
	*	@buffer	- this buffer returns the data obtained
	*	@len	- this is the length which is expected to be read
	*/
	mdmStatus mdmRead(mdmIface *mdm, char *buffer, uint32_t len)
	{
		char data = 0, i= 0;
		static uint32_t paylen = 0;
		static uint32_t dataRead = 0;

		debug(CONSOLE,"%s\n\r","In mdmRead");
		if(toggle == 1){
			count = 3;
			toggle = 0;
			do{
				count --;
				res = serialMatch(mdm, "+IPD,", 1000);
			}
			while(res != mdmOK && count > 0);

			if(count > 0)
			{
				count = 0;
				do
				{
					if(serial_rx_ready())
					{
						serial_get(data);							// Payload length
						if(data == ':')
							break;


						if(i!= 0)
							paylen *=10;

						paylen += (char)atoi(&data);
						i++;
					}
				}
				while(1);
				debug(CONSOLE,"PAYLOAD len=%d\n\r",paylen);
			}
			else
			return mdmReadFail;
		}

		if(paylen <= dataRead)
		{
			dataRead = 0;
			return mdmReadFail;
		}

		if(paylen < len)							// Data received is lesser than requested
			len = paylen;

		i = 0;
		TIME_SET(0);

		do{
			if(serial_rx_ready())
			{
				serial_get(buffer[i]);
				dbg_printf("%c ", (char)buffer[i]);
				i++;
				TIME_SET(0);
			}

