antwal/antwal-svnconv/CooCox/STM32GatwayRev0.1/Modem/ModemInterface.c
		}
		while((len != i) && (TIME_TICK < 100));

		dataRead += i;


		if(i == 0)
			count ++;

		mdmSwitch(mdm,COMMAND);		// Come out of the command mode
		// This means data is not there in the buffer; time to tell
		if(count > 2)
			return mdmReadFail;

		//printf("\ntotal=%d read=%d\n",paylen,dataRead);
		return i;									// Number of bytes read

	}

	/*
		 * This function is used to read data in transparent mode
		 * from the open UDP or TCP socket
		 * Paramters
		 * @mdm: Modem Interface
		 * @buffer: Data will be read into this
		 * @len: address of length of data to read
		 * @returns: Success or Fail
		 */
		mdmStatus mdmTransRead(mdmIface *mdm, char *buffer, uint32_t *len)
		{
			uint32_t i = 0;
			char err[8]="ERROR\r", errVar= 0;
			TIME_SET(0);

			do{
				if(serial_rx_ready())
				{
					serial_get(buffer[i]);
					dbg_printf("%c\t", buffer[i]);

					// To match error Condition
					/*if(serial_rx_ready())
					{
						res = serialMatch(mdm, "CLOSED", 100);
						if(res == mdmOK || res == mdmErr)
						{
							printf("Connection Closed or Error Returned\n\r");
							mdmSwitch(mdm,COMMAND);
							return mdmSendFail;
						}
					}*/
					i++;
					TIME_SET(0);
				}
			}
			while((*len != i) && (TIME_TICK < 1000));


			if(TIME_TICK >= 1000)
			{
				*len = i;					// returning the amount of data read
				mdmSwitch(mdm,COMMAND);		// Come out of the command mode
				//mdmClose(mdm);
				return mdmReadFail;
			}


		mdmSwitch(mdm,COMMAND);		// Come out of the command mode
		//mdmClose(mdm);
		return mdmOK;
	}

	/*
	 * This function matches a string provided by match parameter
	 *
	 */
	mdmStatus mdmReadMatch(mdmIface *mdm, char* match)
	{
		res = serialMatch(mdm, match, 100);
		if(res == mdmTimeOut)  // No response or String not found
		{
			debug(CONSOLE,"%s\n\r","Match Not Found");
			mdmSwitch(mdm,COMMAND);		// Come out of the command mode
			return mdmTimeOut;
		}else if (res == mdmErr) // Response: ERROR
		{
			debug(CONSOLE,"%s\n\r","Error Occured");
			mdmSwitch(mdm,COMMAND);		// Come out of the command mode
			return mdmReadFail;
		}
		else if (res == mdmFail) // Response: ERROR
		{
			debug(CONSOLE,"%s\n\r","Error Occured");
			mdmSwitch(mdm,COMMAND);		// Come out of the command mode
			return mdmReadFail;
		}
		return mdmOK;
	}

	/*
	 * This function brings modem from data mode to command mode and vice-vesa
	 * based on the @arg mode
	 * For mode = COMMAND- to command mode from data
	 * mode = DATA - to data mode from command mode
	 */
	mdmStatus mdmSwitch(mdmIface *mdm, uint8_t mode)
	{
			debug(CONSOLE,"%s\n\r","Switching");
			if(mode == COMMAND)
				res = sendwait(mdm, "|+++|\r", "OK", 500);				// For command mode
			else if(mode == DATA)
				res = sendwait(mdm, "ATO\r", "OK", 500);					// For data mode

				if(res != mdmOK)
					return mdmFail;

				return res;
	}


	/*
	 * To know the amount of data sent and remaining in the buffer
	 */
	mdmStatus mdmSentData(mdmIface *mdm)
	{
		res = sendwait(mdm, "AT+CIPACK\r", "OK", 1000);
	}

	/*
	*	To close the TCP or UDP connection
	*	After this if reconnection is required than all the  init
	*	process should be followed again
	*/
	mdmStatus mdmClose(mdmIface *mdm)
	{
		char count;
		res = mdmState(mdm);
		if(state == CONNECT || state == CLOSING || state == CONNECTING)
		{// TCP connection closing takes more time than the UDP
			count = 2;
			do{
				count --;
				if(state == CONNECT)
				{
					res = sendwait(mdm, "AT+CIPCLOSE=1\r", "LOSE OK", 1000);
				}
				else if(state == CLOSE)
					{
						res = mdmOK;
						break;
					}
				else{
					res = sendwait(mdm, "AT+CIPCLOSE=1\r", "LOSE OK", 1000);
				}
				//printf("In close=%d\n",count);
			}
			while(res != mdmOK && count > 0);

			if(count > 0 || res == mdmOK)
			state = CLOSE;
			else
			state = PDPDEACT;			// SHUT the connection
		}
		return res;

	}

	/*
	*	This function shuts down the connection
	*	Puts the modem in IP INITIAL state
	*/
	mdmStatus mdmShut(mdmIface *mdm)
	{
		count = 5;
		do{
			count --;
			res = sendwait(mdm, "AT+CIPSHUT\r", "SHUT OK", 1000);
		}
		while(res != mdmOK && count > 0);

		state = SHUT;
		return res;
	}

